/************************************************************************
 * @file bsp_ir_reg.h
 * @brief ir灰度传感器寄存器
 *
 * 详细描述:
 * - 功能1: 具体描述
 * - 功能2: 具体描述
 *
 * @author DFBH
 * @date 2026-06-15
 * @version 1.0.0
 *
 * @note 备注信息 (可选)
 * @warning 警告信息 (可选)
 ************************************************************************/
#define IR_ADDRESS (0x12 << 1)

#define IR_CALIBRATION_REG 0x01 // 校准寄存器 1 进入校准模式 0 退出校准 模式
#define IR_STATE_REG    0x30 // 11111111(2进制) 每一位 代表一个探头
         // x1-x8
